tutorials/multiphase/cavitatingFoam/ras/throttle/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     5.0                                |
|   \\  /    A nd           | Web:         http://www.foam-extend.org         |
|    \\/     M anipulation  | For copyright notice see file Copyright         |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

libs
(
    "libincompressibleRASModels.so"
    "liblduSolvers.so"
)

startFrom                  latestTime;

startTime                  0;

stopAt                     endTime;

endTime                    2e-3;

deltaT                     1e-8;

writeControl               adjustableRunTime;

writeInterval              1e-4;

purgeWrite                 0;

writeFormat                ascii;

writePrecision             6;

writeCompression           uncompressed;

timeFormat                 general;

runTimeModifiable          yes;

adjustTimeStep             on;

maxCo                      0.5;

maxAcousticCo              50.0;

// ************************************************************************* //
