tutorials/multiphase/cavitatingFoam/ras/throttle/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     5.0                                |
|   \\  /    A nd           | Web:         http://www.foam-extend.org         |
|    \\/     M anipulation  | For copyright notice see file Copyright         |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

4
(
    inlet
    {
        type            patch;
        nFaces          51;
        startFace       23114;
    }
    outlet
    {
        type            patch;
        nFaces          51;
        startFace       23165;
    }
    walls
    {
        type            wall;
        nFaces          512;
        startFace       23216;
    }
    frontBack
    {
        type            empty;
        nFaces          23340;
        startFace       23728;
    }
)

// ************************************************************************* //
