tutorials/multiphase/cavitatingFoam/ras/throttle/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     5.0                                |
|   \\  /    A nd           | Web:         http://www.foam-extend.org         |
|    \\/     M anipulation  | For copyright notice see file Copyright         |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    omega
    {
        solver           BiCGStab;
        preconditioner   DILU;
        tolerance        1e-08;
        relTol           0;
    }

    k
    {
        solver           BiCGStab;
        preconditioner   DILU;
        tolerance        1e-08;
        relTol           0;
    }

    rho
    {
        solver           BiCGStab;
        preconditioner   DILU;
        tolerance        1e-08;
        relTol           0;
    }

    U
    {
        solver           BiCGStab;
        preconditioner   DILU;
        tolerance        1e-08;
        relTol           0;
    }

    p
    {
        solver           GAMG;
        tolerance        1e-8;
        relTol           0;

        smoother         GaussSeidel;
        nPreSweeps       0;
        nPostSweeps      2;

        cacheAgglomeration true;

        nCellsInCoarsestLevel 10;
        agglomerator     faceAreaPair;
        mergeLevels      1;
    }

    pFinal
    {
        solver           GAMG;
        tolerance        1e-8;
        relTol           0;

        smoother         GaussSeidel;
        nPreSweeps       0;
        nPostSweeps      2;

        cacheAgglomeration true;

        nCellsInCoarsestLevel 10;
        agglomerator     faceAreaPair;
        mergeLevels      1;
    }
}

PIMPLE
{
    nCorrectors                2;
    nNonOrthogonalCorrectors   1;

//    removeSwirl                2;
}

// ************************************************************************* //
